In [4]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
import matplotlib.pyplot as plt

In [8]:
edu = pd.read_csv("Book.csv")

In [10]:
edu.head()

   area    price
0   2600  550000
1   3000  565000
2   3200  610000
3   3600  680000
4   4000  725000

In [11]:
edu.tail()

   area    price
0   2600  550000
1   3000  565000
2   3200  610000
3   3600  680000
4   4000  725000

In [19]:
na_values = ',',
usecols = ["area"]
print(edu)
pd.read_clipboard()

   area    price
0   2600  550000
1   3000  565000
2   3200  610000
3   3600  680000
4   4000  725000

Empty DataFrame
Columns: [Freetutorials.us]
Index: []

In [20]:
edu.describe()

             area           price
count     5.000000       5.000000
mean   3280.000000  626000.000000
std     540.370243   74949.983322
min    2600.000000  550000.000000
25%    3000.000000  565000.000000
50%    3200.000000  610000.000000
75%    3600.000000  680000.000000
max    4000.000000  725000.000000

In [49]:
edu.append({"area":2343,"price":4600}, ignore_index = True)

C:\Users\dubai\AppData\Local\Temp\ipykernel_14432\2781038769.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  edu.append({"Area":2343,"price":4600}, ignore_index = True)

    area    price    Area
0  2600.0  550000     NaN
1  3000.0  565000     NaN
2  3200.0  610000     NaN
3  3600.0  680000     NaN
4  4000.0  725000     NaN
5     NaN    4600  2343.0